app/views/users/index.html.erb

      <div class="media-body">
        <h4 class="media-heading"><%= link_to user.email, user_path(user) %></h4> <small><%= user.items.count %> Tasks</small>
---
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]