app/views/items/_item.html.erb

INSERT INTO "items" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "88888"], ["user_id", 11], ["created_at", "2015-12-07 23:40:59.896651"], ["updated_at", "2015-12-07 23:40:59.896651"]]
---
    <%= item.name %></br>
    <p> Task age: <%= distance_of_time_in_words( item.created_at, Time.now) %> </p>