app/views/items/destroy.js.erb

<% if @item.destroyed? %>
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 19]]