app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."user_id" = ? AND "items"."id" = ? LIMIT 1  [["user_id", 1], ["id", 45]]
---
  def destroy
    @item = current_user.items.find(params[:id])