app/controllers/items_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "items" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Kick ass at ass kicking"], ["user_id", 1], ["created_at", "2015-12-02 21:24:39.326986"], ["updated_at", "2015-12-02 21:24:39.326986"]]
---
  def create
    # NOTE New
    # user = params(:user)
    # TODO Condense with ternary operator
    @user = User.find(params[:user_id]) if params[:user_id].present?
    @user ||= current_user
    @item = @user.items.new(item_params)
    @item.save