app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id]) if params[:id].present?
    @items = @user.items.all